[
  {
    "id": 1,
    "image": "https://i.ibb.co.com/dhjvNrd/round-blue-facebook-logo-with-white-thick-border-and-long-shadow-on-a-transparent-background-free-pn.webp",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "description": "Facebook stands as the world's most extensive social networking service, facilitating connections among **billions of users globally**. It serves as a comprehensive platform where individuals can nurture both personal relationships and professional networks. The core experience is built around the ability to **share photos, videos, and detailed life updates** on a personalized feed, allowing users to keep friends and family informed of their activities. Beyond personal sharing, Facebook hosts millions of **public and private Groups** centered around highly diverse interests, hobbies, and professional topics, fostering strong community bonds. The platform also includes a robust **Marketplace** for buying and selling local items, creating a seamless e-commerce experience right within the app. For creators and businesses, Facebook offers extensive tools for advertising, analytics, and content distribution, alongside popular features like **robust live-streaming capabilities** for real-time engagement. Its sophisticated news feed algorithm is constantly evolving, designed to surface relevant content, current events, and personalized recommendations, making it an essential, multi-faceted tool for modern digital life, essential for staying informed, maintaining social ties, and discovering local services.",
    "size": 180,
    "reviews": "125k",
    "ratingAvg": 4.1,
    "downloads": "2B+",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 4500000 },
      { "name": "5 star", "count": 7000000 }
    ]
  },
  {
    "id": 2,
    "image": "https://i.ibb.co.com/W4Y0tBCt/whatsapp-1984584-640.webp",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "description": "WhatsApp is a globally dominant, free, simple, secure, and highly reliable cross-platform messaging and calling application, utilizing your phone's internet connection (4G/3G/2G/EDGE or Wi-Fi) to function. This allows users to **send and receive text and voice messages** without incurring traditional SMS charges. The application’s reputation is strongly built on its **end-to-end encryption** feature, which is enabled by default, ensuring all private chats, calls, and shared media remain secure and only accessible to the communicating parties. Users rely on WhatsApp for making **high-quality HD video and voice calls** to individuals and groups, connecting seamlessly with friends and family across different countries and time zones. Furthermore, it allows for the effortless exchange of various media types—photos, videos, and documents—and includes features like **sharing live location** for added convenience. WhatsApp also supports large-scale **Group Chats** for multiple participants and features a **Status** function, enabling users to share temporary updates, images, and short video clips that disappear after 24 hours. This comprehensive set of tools makes WhatsApp the definitive, secure platform for all forms of digital communication globally, prioritizing both ease of use and user privacy.",
    "size": 120,
    "reviews": "82k",
    "ratingAvg": 4.4,
    "downloads": "4B+",
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2800000 },
      { "name": "5 star", "count": 4630000 }
    ]
  },
  {
    "id": 3,
    "image": "https://i.ibb.co.com/Gf5WQMjT/instagram-6338393-1280.webp",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "description": "Instagram is a highly influential and dynamic visual-first social media platform, primarily built around immersive **photo and video sharing**. It provides a creative and engaging space for users to share their daily lives and aesthetic moments through three main content formats: the main feed, **Stories** (full-screen, temporary photo/video clips that vanish after 24 hours), and **Reels** (short-form, engaging video content designed for rapid consumption). The platform has evolved into a central hub for **creators, influencers, and businesses**, offering a suite of powerful in-app editing tools, various creative filters, and sophisticated **augmented reality effects** (AR Lenses) to enhance content quality. Users actively interact with content through likes, comments, and shares, and can communicate privately via **Direct Messages** (DMs). The highly curated 'Explore' tab utilizes a powerful algorithm to help users discover millions of accounts, content, and products based on their personalized interests. Continual updates and a focus on visual discovery cement Instagram as a leading platform for artistic expression, trendsetting, and digital connectivity, driving cultural conversations worldwide.",
    "size": 150,
    "reviews": "94k",
    "ratingAvg": 4.3,
    "downloads": "2.5B+",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 3850000 }
    ]
  },
  {
    "id": 4,
    "image": "https://i.ibb.co.com/tpHV1YLn/images-3.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube stands firmly as the **world's largest and most popular video-sharing platform**, hosting an unprecedented volume of content that spans billions of hours across virtually every imaginable topic. It is the go-to destination for diverse video consumption, ranging from professional music videos, episodic content, and vlogs to in-depth educational tutorials, breaking news reports, and original documentaries. Key functionalities are designed for both viewers and creators: viewers can **subscribe to their favorite channels** to follow new uploads, organize content into personalized playlists, and easily access the trending section to stay current with global popularity. The platform has successfully integrated **YouTube Shorts** for quick, short-form video engagement. Furthermore, the app offers sophisticated features like playback speed control, casting capabilities to larger screens, and the option (via YouTube Premium) to **download select videos for seamless offline viewing**. As the primary global source for video entertainment, learning, and cultural engagement, YouTube is an indispensable part of the digital media landscape, catering to all ages and interests worldwide.",
    "size": 95,
    "reviews": "167k",
    "ratingAvg": 4.5,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 180000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2700000 },
      { "name": "5 star", "count": 2970000 }
    ]
  },
  {
    "id": 5,
    "image": "https://i.ibb.co.com/5gqTHRY7/Telegram-logo-svg.webp",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "description": "Telegram is a high-speed, cloud-based mobile and desktop messaging application celebrated globally for its unwavering focus on **speed, robust privacy features, and military-grade security**. A defining characteristic is its seamless **synchronization of messages** across all linked devices—users can access their full chat history from any number of phones, tablets, or computers instantly. The application excels in supporting massive communication needs, including **large group chats** accommodating up to 200,000 members and **Channels** used for broadcast communication to unlimited audiences. For heightened security, Telegram offers **Secret Chats** that feature full end-to-end encryption and include options for self-destructing messages and preventing message forwarding. Uniquely, the platform boasts exceptional media handling, allowing users to share remarkably **large files, up to 2GB** each, making it a favorite for professionals, large communities, and those requiring secure and high-capacity file transfers. Its commitment to free, open, and secure communication has positioned Telegram as a leading global messaging alternative.",
    "size": 55,
    "reviews": "55k",
    "ratingAvg": 4.5,
    "downloads": "5.6B+",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2200000 },
      { "name": "5 star", "count": 2480000 }
    ]
  },
  {
    "id": 6,
    "image": "https://i.ibb.co.com/jPkhSFTN/Amazon-Startup-Talky.jpg",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "description": "Amazon Shopping delivers a powerful, seamless, and highly convenient mobile experience designed to **browse, search, and buy millions of products** from the world's largest online retailer directly from your smartphone or tablet. The app is engineered for a user-friendly and trustworthy e-commerce journey, featuring pillars like **fast and reliable shipping options**, hassle-free and straightforward returns, and transparent access to **millions of authentic customer reviews** and ratings. The platform provides highly personalized recommendations based on your unique browsing history, past purchases, and saved lists. Innovative search capabilities include the use of **voice search** and direct **image recognition** (by using your phone's camera) for quick product finding. Additionally, users can effortlessly manage their Wish Lists, track their orders with real-time updates, and take advantage of exclusive **daily deals and mobile-only offers**. This comprehensive set of features makes the Amazon Shopping app an indispensable, all-in-one tool for managing all your digital purchasing needs, from everyday necessities to specialized goods.",
    "size": 110,
    "reviews": "43k",
    "ratingAvg": 4.6,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 120000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 450000 },
      { "name": "4 star", "count": 1900000 },
      { "name": "5 star", "count": 1730000 }
    ]
  },
  {
    "id": 7,
    "image": "https://i.ibb.co.com/KQzcYDL/maps-96in128dp.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "description": "Google Maps is globally recognized as the world's leading **navigation, traffic, and location service**, providing comprehensive, detailed maps for over 220 countries and territories. It offers essential, time-saving features like **real-time GPS navigation** with clear, voice-guided, turn-by-turn directions, coupled with highly accurate **live traffic information** to help users avoid congestion and delays. The app is indispensable for urban and travel planning, offering detailed public transit schedules, routes, and departure times. Users gain the ability to explore **millions of points of interest**, including local businesses, prominent landmarks, and restaurants, often supplemented with up-to-date photos, working hours, and local reviews. Critically, the service supports diverse route planning for **driving, walking, cycling, and public transport**. Furthermore, a key utility is its **offline maps capability**, allowing users to download maps of specific areas to navigate efficiently even without a stable internet connection. Google Maps is truly the definitive, all-purpose tool for local discovery, commuting, and global travel planning.",
    "size": 90,
    "reviews": "72k",
    "ratingAvg": 4.5,
    "downloads": "1.2B+",
    "ratings": [
      { "name": "1 star", "count": 180000 },
      { "name": "2 star", "count": 160000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 3200000 },
      { "name": "5 star", "count": 2960000 }
    ]
  },
  {
    "id": 8,
    "image": "https://i.ibb.co.com/rKQ0hb5g/X-icon-svg.png",
    "title": "X (formerly Twitter)",
    "companyName": "X Corp.",
    "description": "X, formerly known as Twitter, operates as a powerful **global platform for real-time information, conversation, and microblogging**, acting as a crucial rapid-fire news source. Its design allows users to instantly follow **breaking news, cultural events, and the most rapidly trending topics** as they unfold globally. Users actively connect with a diverse global audience, easily sharing their thoughts, opinions, media, and links in short, impactful posts. The platform is often the first place where public discourse begins and evolves, allowing users to connect directly with public figures, politicians, and business leaders. Key features include support for **live video streams**, both public and private **direct messaging**, and sophisticated algorithms that ensure content discovery is highly relevant to individual user interests. X is not just a social network; it is a powerful, dynamic tool for public discourse, instant communication, and quickly engaging in the most relevant global conversations, shaping public opinion minute by minute.",
    "size": 130,
    "reviews": "61k",
    "ratingAvg": 4.1,
    "downloads": "1.8B+",
    "ratings": [
      { "name": "1 star", "count": 140000 },
      { "name": "2 star", "count": 130000 },
      { "name": "3 star", "count": 550000 },
      { "name": "4 star", "count": 2600000 },
      { "name": "5 star", "count": 2780000 }
    ]
  },
  {
    "id": 9,
    "image": "https://i.ibb.co.com/8g9g9SqD/2024-spotify-brand-assets-media-kit.jpg",
    "title": "Spotify: Music and Podcasts",
    "companyName": "Spotify AB",
    "description": "Spotify is the world's leading and most popular **digital music and podcast streaming service**, granting access to a massive library featuring **millions of songs and exclusive podcasts** from every artist, creator, and publisher globally. The platform is celebrated for its personalization, allowing users to effortlessly **create, share, and manage personalized playlists** while discovering new content through highly custom-tailored recommendations like the acclaimed 'Discover Weekly' and personalized daily mixes. For premium subscribers, a critical function is the ability to **download content for seamless offline listening**, ensuring entertainment is always available regardless of connectivity. Spotify delivers a truly seamless, multi-device listening experience, functioning perfectly across phones, tablets, computers, smart speakers, and car systems. Users can also follow friends and artists to see their activity and favorite tracks. With its vast library and powerful recommendation engine, Spotify remains the definitive, go-to platform for all audio entertainment needs, supporting both curated and spontaneous music discovery.",
    "size": 140,
    "reviews": "79k",
    "ratingAvg": 4.6,
    "downloads": "1.6B+",
    "ratings": [
      { "name": "1 star", "count": 90000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1700000 },
      { "name": "5 star", "count": 1610000 }
    ]
  },
  {
    "id": 10,
    "image": "https://i.ibb.co.com/gbdckFB5/Brand-Assets-Logos-01-Wordmark.jpg",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "description": "Netflix is recognized as the **world's leading subscription streaming service** for watching an enormous, constantly evolving library of TV episodes, blockbuster movies, thought-provoking documentaries, and exclusive stand-up specials. It provides instant, on-demand access to thousands of titles directly on your mobile device, smart TV, or computer, with new, **original content and licensed programming added weekly**. To enhance the family experience, users have the capability to **create multiple profiles** under a single account, ensuring personalized content recommendations and viewing history for each user. The app features robust smart search functions, parental controls, and is famously known for allowing users to **download select shows and movies** to watch offline without requiring an active internet connection—perfect for travel. Its powerful recommendation engine uses viewing data to help users effortlessly discover content tailored precisely to their taste, solidifying Netflix's position as the dominant choice for premium, binge-worthy video entertainment worldwide.",
    "size": 70,
    "reviews": "48k",
    "ratingAvg": 4.5,
    "downloads": "2.2B+",
    "ratings": [
      { "name": "1 star", "count": 110000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 450000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 2150000 }
    ]
  },
  {
    "id": 11,
    "image": "https://i.ibb.co.com/cSDnpt5q/images.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "description": "Gmail is Google's **powerful, highly efficient, and industry-leading secure email client**, offering a clean, user-friendly interface and a robust suite of features designed for seamless personal and professional communication. Key organizational capabilities include an intelligent **smart inbox** that automatically and accurately sorts incoming emails into distinct, customizable categories (such as Primary, Social, and Promotions), significantly reducing clutter. The platform features superior **advanced search functionality** for quickly and accurately locating old messages and provides best-in-class, highly sophisticated **automatic spam and phishing filtering** to ensure user safety. Users benefit from 15GB of free storage that is shared across their entire Google account, comprehensive support for managing multiple email accounts, and productivity-boosting features like **Smart Compose/Smart Reply** which use AI to speed up the drafting process. Integrated deeply with other Google services like Calendar and Drive, Gmail is designed to make email management intelligent, safe, and fully integrated into the modern digital workflow.",
    "size": 60,
    "reviews": "52k",
    "ratingAvg": 4.6,
    "downloads": "5.2B+",
    "ratings": [
      { "name": "1 star", "count": 120000 },
      { "name": "2 star", "count": 140000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2300000 },
      { "name": "5 star", "count": 2140000 }
    ]
  },
  {
    "id": 12,
    "image": "https://i.ibb.co.com/SwsgP82L/images-1.png",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "description": "TikTok is the premier global platform that has completely revolutionized the consumption of **short-form mobile videos**, quickly becoming a cultural phenomenon worldwide. The user experience is defined by the **'For You Page' (FYP)**, a highly addictive and personalized feed of videos driven by a powerful algorithm based on the user's viewing habits, likes, and shares. The app makes **content creation exceptionally easy** and accessible to everyone, providing a vast array of user-friendly editing tools, a huge library of trending music, dynamic filters, and engaging special effects. It is a breeding ground for viral trends and challenges, fostering rapid community growth and allowing users to express themselves creatively and authentically. Users can seamlessly engage in live streams, send direct messages, and explore content from a **diverse global creator community**. Its rapid virality and constantly shifting cultural landscape solidify TikTok's position as the leading platform for instant, mobile video entertainment, keeping hundreds of millions of users engaged daily.",
    "size": 170,
    "reviews": "98k",
    "ratingAvg": 4.4,
    "downloads": "2.7B+",
    "ratings": [
      { "name": "1 star", "count": 220000 },
      { "name": "2 star", "count": 180000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 3600000 },
      { "name": "5 star", "count": 4000000 }
    ]
  },
  {
    "id": 13,
    "image": "https://i.ibb.co.com/3y9Ycqn9/Google-Chrome-icon-February-2022-svg.png",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "description": "Google Chrome is recognized as the world's most dominant and popular **fast, easy-to-use, and highly secure web browser**, built upon the open-source Chromium project. It is engineered to provide a seamless and highly efficient browsing experience across all user devices. A critical feature is its capability to **instantly sync bookmarks, saved passwords, and personalized settings** across every signed-in device, ensuring a consistent web experience whether you are on your phone, tablet, or desktop. Security is paramount, with robust built-in features to protect users from dangerous and malicious websites, issuing timely warnings. Users can employ **incognito mode** for private browsing that leaves no local history trail and utilize the **built-in data saver feature** to reduce mobile data consumption. Chrome's minimalist design, cross-platform stability, and access to an extensive library of extensions make it the go-to, indispensable choice for fast and reliable access to the entire World Wide Web.",
    "size": 85,
    "reviews": "46k",
    "ratingAvg": 4.3,
    "downloads": "3.3B+",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 2210000 }
    ]
  },
  {
    "id": 14,
    "image": "https://i.ibb.co.com/LXvdKrmw/images-2.png",
    "title": "Uber",
    "companyName": "Uber Technologies, Inc.",
    "description": "Uber is a groundbreaking and globally integrated platform that efficiently simplifies **ride-sharing, professional food delivery (Uber Eats), and large-scale freight logistics**, dramatically transforming urban mobility and services. The core ride-sharing service allows users to effortlessly request a ride in minutes via the app, providing a range of reliable transportation options tailored to various needs and budgets, from economy rides to premium comfort options. Users can **track their assigned driver's arrival in real-time** on an interactive map and communicate directly with them if needed. The app guarantees a frictionless experience with the convenience of **cashless payments** saved securely within the platform, eliminating the need for physical currency transactions. Furthermore, Uber maintains an unwavering commitment to user safety, offering essential **24/7 safety features**, shareable trip details, and dedicated customer support, making it an indispensable, reliable service for navigating the urban landscape and fulfilling on-demand delivery needs.",
    "size": 105,
    "reviews": "54k",
    "ratingAvg": 4.2,
    "downloads": "550M+",
    "ratings": [
      { "name": "1 star", "count": 130000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 2050000 }
    ]
  },
  {
    "id": 15,
    "image": "https://i.ibb.co.com/nNT9TdSD/1-snapchat.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat is a highly influential camera and messaging application that famously pioneered **instant, ephemeral communication**, changing how people interact with media. Its core function is the ability to send 'Snaps'—photos and videos—that are designed to **disappear instantly** after they are viewed, thereby fostering a casual, spontaneous, and less-filtered way to communicate with close friends. Users can engage in quick **instant chatting** with friends, explore original, professionally produced short-form content on the 'Discover' tab, and most distinctively, play with a massive, constantly updated library of **augmented reality Lenses** for fun filters, effects, and interactive experiences. It is a key platform for visual storytelling, maintaining communication 'streaks' with friends, and accessing innovative **location-based features** like the Snap Map, which allows users to see where their friends are and what’s happening around the globe. Snapchat continues to prioritize the camera and playful, temporary content.",
    "size": 160,
    "reviews": "820k",
    "ratingAvg": 4.0,
    "downloads": "3.6B+",
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 130000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 3200000 },
      { "name": "5 star", "count": 4020000 }
    ]
  },
  {
    "id": 16,
    "image": "https://i.ibb.co.com/WCZ8tRb/images-1.jpg",
    "title": "Clash of Clans",
    "companyName": "Supercell",
    "description": "Clash of Clans is a hugely popular and highly addictive **strategy-based multiplayer mobile game** where players assume the role of the chief of their own nascent village. The central gameplay loop revolves around the necessity to **build, defend, and strategically upgrade your village** using gold and elixir, all while raising and training a mighty army comprised of various troops, spells, and powerful siege machines. The overarching goal is to **compete with millions of players worldwide** by attacking their bases in raids to loot valuable resources and earn trophies to climb the global rankings. The social and competitive aspects of the game are centered around **forging powerful Clans** with friends and other players globally. Clan members then work together to participate in epic **Clan Wars**, where organized strategy, cooperative donations of troops, and perfect teamwork are paramount to crushing enemy clans, securing victory, and earning substantial war bonuses. The game demands both long-term strategic planning and real-time tactical execution.",
    "size": 250,
    "reviews": "100k",
    "ratingAvg": 4.3,
    "downloads": "600M+",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 350000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 2160000 }
    ]
  }
]
